# -*- coding: utf-8 -*-
# @Time     : 2020/3/10 22:10
# @Author   : Monster
# @Email    : 945534456@qq.com
# @File     : class5_tuple.py


#【5】: 元祖 tuple 符号()

a=(1,0.02,'hello',[1,2,3],True,(4,5,6))

# 1:可与存在空元祖a=()
# 2:元祖里面可以包含任何数据类型  # print(type(a))
# 3:元祖里面的元素 根据逗号来进行分割
# 4：元祖里面的元素 也是有索引 索引值从0开始
# 5：获取元祖里面的单个值： 元祖[索引值]  #print(a[4])
# 6:元祖的切片 同字符串操作 列表名[索引头:索引尾:步长]  # print(a[0:5:2])

#如果元祖里面只有一个元素 要加逗号
# a=(1,) #print("要加逗号:",type(a))

#---------------->>>>>>>>>分割线<<<<<<<<<<<<<--------------

#（1）元祖用在什么时候 ？
# 操作数据库的时候 会存放条件

#（2）元祖不支持任何修改（增、删、改）
a=(1,0.02,'hello',[1,2,3],True,(4,5,6))
# a[2] = "哈哈" #TypeError: 'tuple' object does not support item assignment

#（3）特殊情况，可以修改里面的值（可修改类型，如：列表）
#a[3][-1]="怪兽" #(1, 0.02, 'hello', [1, 2, '怪兽'], True, (4, 5, 6))
#a[3].pop() #(1, 0.02, 'hello', [1, 2], True, (4, 5, 6))  #print(a)

b=[1,0.02,'hello',[1,2,3],True,(4,5,6)]
#列表整体可以修改替换元祖，但里面的单个值不可以修改
#b[5]="hello" #[1, 0.02, 'hello', [1, 2, 3], True, 'hello']  #print(b)


#---------------->>>>>>>>>分割线<<<<<<<<<<<<<--------------
